app/views/comments/_index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <footer class="blockquote-footer">
        <strong><%= link_to "#{comment.user.first_name + " " + comment.user.last_name}", user_path(comment.user.id) %></strong>