app/views/gossips/index.html.erb

  <div class="row">
    <% Gossip.all.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips"


            <p class="card-text text-center " > <strong >&quot</strong> <%= link_to gossip.user.first_name, user_path(gossip.user.id) %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]