app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @gossips = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @gossip = Gossip.find(params[:id])

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def new
    @gossip = Gossip.new(title: "", content: "", user: User.last)

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "la montagne"], ["content", "la montagne est vegan"], ["user_id", 1], ["created_at", "2020-05-07 21:03:51.124139"], ["updated_at", "2020-05-07 21:03:51.124139"]]
---
def create
    @gossip = Gossip.new(user: User.first, title: params[:title], content: params[:content])

    if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def edit
    @gossip = Gossip.find(params[:id])